In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(
    {
        'name': ['Ali', 'Zahid', 'Ubaid'],
        'age' : [18, 20, 18]
    }
)
df

    name  age
0    Ali   18
1  Zahid   20
2  Ubaid   18

In [5]:
# Values replace in specific column
df['age'] = df['age'].replace({18:25})
df

    name  age
0    Ali   25
1  Zahid   20
2  Ubaid   25

In [13]:
# How to change specific location value
df.iloc[0,1] = 27
display(df)

    name  age
0    Ali   27
1  Zahid   20
2  Ubaid   25

In [80]:
df['name'] = df['name'].replace(['Ali', 'Zahid'],['No Name', ' '])
df

      name  age
0  No Name   27
1            20
2    Ubaid   25

In [82]:
df['name'] = df['name'].replace({'Ali':'No name', 'Zahid':' '})
df

      name  age
0  No Name   27
1            20
2    Ubaid   25

### MAP

In [86]:
df

    name  age
0    Ali   27
1  Zahid   20
2  Ubaid   25

In [88]:
df['age'].map(lambda age:'Older' if age>25 else 'Younger')

0      Older
1    Younger
2    Younger
Name: age, dtype: object

Assignment: What is the difference between map and apply

What is the difference between map(), applymap() and apply() methods in pandas? â€“ In padas, all these methods are used to perform either to modify the DataFrame or Series. map() is a method of Series, applymap() is a method of DataFrame, and apply() is defined in both DataFrame and Series.

In [89]:
data = [(3,5,7),(2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns=['A','B','C'])
df

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [90]:
df['A'] = df['A'].apply(lambda x: x/10)
display(df)

     A  B  C
0  0.3  5  7
1  0.2  4  6
2  0.5  8  9

In [92]:
data = [(3,5,7),(2,4,6),(5,8,9)]
df2 = pd.DataFrame(data, columns=['A','B','C'])
display(df2)

df2 = df2.apply(lambda x: x/10)
display(df2)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

     A    B    C
0  0.3  0.5  0.7
1  0.2  0.4  0.6
2  0.5  0.8  0.9

In [2]:
df = pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=['A', 'B', 'C'],
    columns=['C1', 'C2', 'C3', 'C4']
)

df

   C1  C2  C3  C4
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11

In [3]:
df.loc['A']

C1    0
C2    1
C3    2
C4    3
Name: A, dtype: int32

In [5]:
df.iloc[1]

C1    4
C2    5
C3    6
C4    7
Name: B, dtype: int32

In [6]:
df.index

Index(['A', 'B', 'C'], dtype='object')

In [7]:
index_to_country = {
    'A': 'Australia',
    'B': 'Brazil',
    'C': 'China'
}

In [8]:
df.index = df.index.map(index_to_country)

In [9]:
df

           C1  C2  C3  C4
Australia   0   1   2   3
Brazil      4   5   6   7
China       8   9  10  11

In [10]:
df.loc['Australia']

C1    0
C2    1
C3    2
C4    3
Name: Australia, dtype: int32

Other index methods

In [12]:
df.rename(index=str.upper, columns=str.lower)

           c1  c2  c3  c4
AUSTRALIA   0   1   2   3
BRAZIL      4   5   6   7
CHINA       8   9  10  11

In [14]:
df.rename(index={'China': 'California'}, columns={'C1':'C11'}, inplace=True)
df

            C11  C2  C3  C4
Australia     0   1   2   3
Brazil        4   5   6   7
California    8   9  10  11